---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.CoreElemTestingError
source: html/a46c8cfe-6455-5a2d-3840-42ab61539ddc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.CoreElemTestingError Property

Core element testing error (internal).

## Syntax (C#)
```csharp
public static FailureDefinitionId CoreElemTestingError { get; }
```